#### BuiltInFailures.LevelAssociationFailures Members

---

|  |
| --- |
| BuiltInFailures LevelAssociationFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures LevelAssociationFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AllLevelsDeleted | All Levels from model were deleted |

# See Also

BuiltInFailures LevelAssociationFailures Class

Autodesk.Revit.DB Namespace